mcuxrandall/2.04-Integration/MCXN947_TXST_Peripheral_Integration/device/periph/PERI_VBAT.h
/*
** Start of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic push
  #else
    #pragma push
    #pragma anon_unions
  #endif
#elif defined(__GNUC__)
  /* anonymous unions are enabled by default */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=extended
#else
  #error Not supported compiler type
#endif

/* ----------------------------------------------------------------------------
   -- VBAT Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup VBAT_Peripheral_Access_Layer VBAT Peripheral Access Layer
 * @{
 */

/** VBAT - Size of Registers Arrays */
#define VBAT_WAKEUP_COUNT                         2u

/** VBAT - Register Layout Typedef */
typedef struct {
  __I  uint32_t VERID;                             /**< Version ID, offset: 0x0 */
       uint8_t RESERVED_0[12];
  __IO uint32_t STATUSA;                           /**< Status A, offset: 0x10 */
  __IO uint32_t STATUSB;                           /**< Status B, offset: 0x14 */
  __IO uint32_t IRQENA;                            /**< Interrupt Enable A, offset: 0x18 */
  __IO uint32_t IRQENB;                            /**< Interrupt Enable B, offset: 0x1C */
  __IO uint32_t WAKENA;                            /**< Wake-up Enable A, offset: 0x20 */
  __IO uint32_t WAKENB;                            /**< Wake-up Enable B, offset: 0x24 */
  __IO uint32_t TAMPERA;                           /**< Tamper Enable A, offset: 0x28 */
  __IO uint32_t TAMPERB;                           /**< Tamper Enable B, offset: 0x2C */
  __IO uint32_t LOCKA;                             /**< Lock A, offset: 0x30 */
  __IO uint32_t LOCKB;                             /**< Lock B, offset: 0x34 */
  __IO uint32_t WAKECFG;                           /**< Wake-up Configuration, offset: 0x38 */
       uint8_t RESERVED_1[196];
  __IO uint32_t OSCCTLA;                           /**< Oscillator Control A, offset: 0x100 */
  __IO uint32_t OSCCTLB;                           /**< Oscillator Control B, offset: 0x104 */
  __IO uint32_t OSCCFGA;                           /**< Oscillator Configuration A, offset: 0x108 */
  __IO uint32_t OSCCFGB;                           /**< Oscillator Configuration B, offset: 0x10C */
       uint8_t RESERVED_2[8];
  __IO uint32_t OSCLCKA;                           /**< Oscillator Lock A, offset: 0x118 */
  __IO uint32_t OSCLCKB;                           /**< Oscillator Lock B, offset: 0x11C */
  __IO uint32_t OSCCLKE;                           /**< Oscillator Clock Enable, offset: 0x120 */
       uint8_t RESERVED_3[220];
  __IO uint32_t FROCTLA;                           /**< FRO16K Control A, offset: 0x200 */
  __IO uint32_t FROCTLB;                           /**< FRO16K Control B, offset: 0x204 */
       uint8_t RESERVED_4[16];
  __IO uint32_t FROLCKA;                           /**< FRO16K Lock A, offset: 0x218 */
  __IO uint32_t FROLCKB;                           /**< FRO16K Lock B, offset: 0x21C */
  __IO uint32_t FROCLKE;                           /**< FRO16K Clock Enable, offset: 0x220 */
       uint8_t RESERVED_5[220];
  __IO uint32_t LDOCTLA;                           /**< LDO_RAM Control A, offset: 0x300 */
  __IO uint32_t LDOCTLB;                           /**< LDO_RAM Control B, offset: 0x304 */
       uint8_t RESERVED_6[16];
  __IO uint32_t LDOLCKA;                           /**< LDO_RAM Lock A, offset: 0x318 */
  __IO uint32_t LDOLCKB;                           /**< LDO_RAM Lock B, offset: 0x31C */
  __IO uint32_t LDORAMC;                           /**< RAM Control, offset: 0x320 */
       uint8_t RESERVED_7[12];
  __IO uint32_t LDOTIMER0;                         /**< Bandgap Timer 0, offset: 0x330 */
       uint8_t RESERVED_8[4];
  __IO uint32_t LDOTIMER1;                         /**< Bandgap Timer 1, offset: 0x338 */
       uint8_t RESERVED_9[196];
  __IO uint32_t MONCTLA;                           /**< CLKMON Control A, offset: 0x400 */
  __IO uint32_t MONCTLB;                           /**< CLKMON Control B, offset: 0x404 */
  __IO uint32_t MONCFGA;                           /**< CLKMON Configuration A, offset: 0x408 */
  __IO uint32_t MONCFGB;                           /**< CLKMON Configuration B, offset: 0x40C */
       uint8_t RESERVED_10[8];
  __IO uint32_t MONLCKA;                           /**< CLKMON Lock A, offset: 0x418 */
  __IO uint32_t MONLCKB;                           /**< CLKMON Lock B, offset: 0x41C */
       uint8_t RESERVED_11[224];
  __IO uint32_t TAMCTLA;                           /**< TAMPER Control A, offset: 0x500 */
  __IO uint32_t TAMCTLB;                           /**< TAMPER Control B, offset: 0x504 */
       uint8_t RESERVED_12[16];
  __IO uint32_t TAMLCKA;                           /**< TAMPER Lock A, offset: 0x518 */
  __IO uint32_t TAMLCKB;                           /**< TAMPER Lock B, offset: 0x51C */
       uint8_t RESERVED_13[224];
  __IO uint32_t SWICTLA;                           /**< Switch Control A, offset: 0x600 */
  __IO uint32_t SWICTLB;                           /**< Switch Control B, offset: 0x604 */
       uint8_t RESERVED_14[16];
  __IO uint32_t SWILCKA;                           /**< Switch Lock A, offset: 0x618 */
  __IO uint32_t SWILCKB;                           /**< Switch Lock B, offset: 0x61C */
       uint8_t RESERVED_15[224];
  struct {                                         /* offset: 0x700, array step: 0x8 */
    __IO uint32_t WAKEUPA;                           /**< Wakeup 0 Register A, array offset: 0x700, array step: 0x8 */
    __IO uint32_t WAKEUPB;                           /**< Wakeup 0 Register B, array offset: 0x704, array step: 0x8 */
  } WAKEUP[VBAT_WAKEUP_COUNT];
       uint8_t RESERVED_16[232];
  __IO uint32_t WAKLCKA;                           /**< Wakeup Lock A, offset: 0x7F8 */
  __IO uint32_t WAKLCKB;                           /**< Wakeup Lock B, offset: 0x7FC */
} VBAT_Type;

/* ----------------------------------------------------------------------------
   -- VBAT Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup VBAT_Register_Masks VBAT Register Masks
 * @{
 */

