mcuxrandall/2.04-Integration/MCXN947_TXST_Peripheral_Integration/device/periph/PERI_VBAT.h
/*! @name MONLCKA - CLKMON Lock A */
/*! @{ */

#define VBAT_MONLCKA_LOCK_MASK                   (0x1U)
#define VBAT_MONLCKA_LOCK_SHIFT                  (0U)
/*! LOCK - Lock
 *  0b0..Lock is disabled
 *  0b1..Lock is enabled
 */
#define VBAT_MONLCKA_LOCK(x)                     (((uint32_t)(((uint32_t)(x)) << VBAT_MONLCKA_LOCK_SHIFT)) & VBAT_MONLCKA_LOCK_MASK)
/*! @} */

/*! @name MONLCKB - CLKMON Lock B */
/*! @{ */

#define VBAT_MONLCKB_LOCK_MASK                   (0x1U)
#define VBAT_MONLCKB_LOCK_SHIFT                  (0U)
/*! LOCK - Lock
 *  0b0..Lock is enabled
 *  0b1..Lock is disabled
 */
#define VBAT_MONLCKB_LOCK(x)                     (((uint32_t)(((uint32_t)(x)) << VBAT_MONLCKB_LOCK_SHIFT)) & VBAT_MONLCKB_LOCK_MASK)
/*! @} */

/*! @name TAMCTLA - TAMPER Control A */
/*! @{ */

#define VBAT_TAMCTLA_VOLT_EN_MASK                (0x1U)
#define VBAT_TAMCTLA_VOLT_EN_SHIFT               (0U)
/*! VOLT_EN - Voltage Detect Enable
 *  0b0..Voltage detect is disabled
 *  0b1..Voltage detect is enabled
 */
#define VBAT_TAMCTLA_VOLT_EN(x)                  (((uint32_t)(((uint32_t)(x)) << VBAT_TAMCTLA_VOLT_EN_SHIFT)) & VBAT_TAMCTLA_VOLT_EN_MASK)

#define VBAT_TAMCTLA_TEMP_EN_MASK                (0x2U)
#define VBAT_TAMCTLA_TEMP_EN_SHIFT               (1U)
/*! TEMP_EN - Temperature Detect Enable
 *  0b0..Temperature detect is disabled
 *  0b1..Temperature detect is enabled
 */
#define VBAT_TAMCTLA_TEMP_EN(x)                  (((uint32_t)(((uint32_t)(x)) << VBAT_TAMCTLA_TEMP_EN_SHIFT)) & VBAT_TAMCTLA_TEMP_EN_MASK)

#define VBAT_TAMCTLA_LIGHT_EN_MASK               (0x4U)
#define VBAT_TAMCTLA_LIGHT_EN_SHIFT              (2U)
/*! LIGHT_EN - Light Detect Enable
 *  0b0..Light detect is disabled
 *  0b1..Light detect is enabled
 */
#define VBAT_TAMCTLA_LIGHT_EN(x)                 (((uint32_t)(((uint32_t)(x)) << VBAT_TAMCTLA_LIGHT_EN_SHIFT)) & VBAT_TAMCTLA_LIGHT_EN_MASK)
/*! @} */

/*! @name TAMCTLB - TAMPER Control B */
/*! @{ */

#define VBAT_TAMCTLB_INVERSE_MASK                (0xFU)
#define VBAT_TAMCTLB_INVERSE_SHIFT               (0U)
/*! INVERSE - Inverse value */
#define VBAT_TAMCTLB_INVERSE(x)                  (((uint32_t)(((uint32_t)(x)) << VBAT_TAMCTLB_INVERSE_SHIFT)) & VBAT_TAMCTLB_INVERSE_MASK)
/*! @} */

/*! @name TAMLCKA - TAMPER Lock A */
/*! @{ */

#define VBAT_TAMLCKA_LOCK_MASK                   (0x1U)
#define VBAT_TAMLCKA_LOCK_SHIFT                  (0U)
/*! LOCK - Lock
 *  0b0..Lock is disabled
 *  0b1..Lock is enabled
 */
#define VBAT_TAMLCKA_LOCK(x)                     (((uint32_t)(((uint32_t)(x)) << VBAT_TAMLCKA_LOCK_SHIFT)) & VBAT_TAMLCKA_LOCK_MASK)
/*! @} */

/*! @name TAMLCKB - TAMPER Lock B */
/*! @{ */

#define VBAT_TAMLCKB_LOCK_MASK                   (0x1U)
#define VBAT_TAMLCKB_LOCK_SHIFT                  (0U)
/*! LOCK - Lock
 *  0b0..Lock is enabled
 *  0b1..Lock is disabled
 */
#define VBAT_TAMLCKB_LOCK(x)                     (((uint32_t)(((uint32_t)(x)) << VBAT_TAMLCKB_LOCK_SHIFT)) & VBAT_TAMLCKB_LOCK_MASK)
/*! @} */

/*! @name SWICTLA - Switch Control A */
/*! @{ */

#define VBAT_SWICTLA_SWI_EN_MASK                 (0x1U)
#define VBAT_SWICTLA_SWI_EN_SHIFT                (0U)
/*! SWI_EN - Switch Enable
 *  0b0..VDD_BAT
 *  0b1..VDD_SYS
 */
#define VBAT_SWICTLA_SWI_EN(x)                   (((uint32_t)(((uint32_t)(x)) << VBAT_SWICTLA_SWI_EN_SHIFT)) & VBAT_SWICTLA_SWI_EN_MASK)

#define VBAT_SWICTLA_LP_EN_MASK                  (0x2U)
#define VBAT_SWICTLA_LP_EN_SHIFT                 (1U)
/*! LP_EN - Low Power Enable
 *  0b0..VDD_BAT always supplies VBAT modules in low-power modes
 *  0b1..VDD_SYS always supplies VBAT modules if SWI_EN is also 1
 */
#define VBAT_SWICTLA_LP_EN(x)                    (((uint32_t)(((uint32_t)(x)) << VBAT_SWICTLA_LP_EN_SHIFT)) & VBAT_SWICTLA_LP_EN_MASK)
/*! @} */

/*! @name SWICTLB - Switch Control B */
/*! @{ */

#define VBAT_SWICTLB_INVERSE_MASK                (0x3U)
#define VBAT_SWICTLB_INVERSE_SHIFT               (0U)
/*! INVERSE - Inverse Value */
#define VBAT_SWICTLB_INVERSE(x)                  (((uint32_t)(((uint32_t)(x)) << VBAT_SWICTLB_INVERSE_SHIFT)) & VBAT_SWICTLB_INVERSE_MASK)
/*! @} */

/*! @name SWILCKA - Switch Lock A */
/*! @{ */

#define VBAT_SWILCKA_LOCK_MASK                   (0x1U)
#define VBAT_SWILCKA_LOCK_SHIFT                  (0U)
/*! LOCK - Lock
 *  0b0..Do not block
 *  0b1..Block
 */
#define VBAT_SWILCKA_LOCK(x)                     (((uint32_t)(((uint32_t)(x)) << VBAT_SWILCKA_LOCK_SHIFT)) & VBAT_SWILCKA_LOCK_MASK)
/*! @} */

/*! @name SWILCKB - Switch Lock B */
/*! @{ */

#define VBAT_SWILCKB_LOCK_MASK                   (0x1U)
#define VBAT_SWILCKB_LOCK_SHIFT                  (0U)
/*! LOCK - Lock
 *  0b0..Block
 *  0b1..Do not block
 */
#define VBAT_SWILCKB_LOCK(x)                     (((uint32_t)(((uint32_t)(x)) << VBAT_SWILCKB_LOCK_SHIFT)) & VBAT_SWILCKB_LOCK_MASK)
/*! @} */

/*! @name WAKEUP_WAKEUPA - Wakeup 0 Register A */
/*! @{ */

#define VBAT_WAKEUP_WAKEUPA_REG_MASK             (0xFFFFFFFFU)
#define VBAT_WAKEUP_WAKEUPA_REG_SHIFT            (0U)
/*! REG - Register */
#define VBAT_WAKEUP_WAKEUPA_REG(x)               (((uint32_t)(((uint32_t)(x)) << VBAT_WAKEUP_WAKEUPA_REG_SHIFT)) & VBAT_WAKEUP_WAKEUPA_REG_MASK)
/*! @} */

/* The count of VBAT_WAKEUP_WAKEUPA */
#define VBAT_WAKEUP_WAKEUPA_COUNT                (2U)

/*! @name WAKEUP_WAKEUPB - Wakeup 0 Register B */
/*! @{ */

#define VBAT_WAKEUP_WAKEUPB_INVERSE_MASK         (0xFFFFFFFFU)
#define VBAT_WAKEUP_WAKEUPB_INVERSE_SHIFT        (0U)
/*! INVERSE - Inverse value */
#define VBAT_WAKEUP_WAKEUPB_INVERSE(x)           (((uint32_t)(((uint32_t)(x)) << VBAT_WAKEUP_WAKEUPB_INVERSE_SHIFT)) & VBAT_WAKEUP_WAKEUPB_INVERSE_MASK)
/*! @} */

/* The count of VBAT_WAKEUP_WAKEUPB */
#define VBAT_WAKEUP_WAKEUPB_COUNT                (2U)

/*! @name WAKLCKA - Wakeup Lock A */
/*! @{ */

#define VBAT_WAKLCKA_LOCK_MASK                   (0x1U)
#define VBAT_WAKLCKA_LOCK_SHIFT                  (0U)
/*! LOCK - Lock
 *  0b0..Lock is disabled
 *  0b1..Lock is enabled
 */
#define VBAT_WAKLCKA_LOCK(x)                     (((uint32_t)(((uint32_t)(x)) << VBAT_WAKLCKA_LOCK_SHIFT)) & VBAT_WAKLCKA_LOCK_MASK)
/*! @} */

/*! @name WAKLCKB - Wakeup Lock B */
/*! @{ */

#define VBAT_WAKLCKB_LOCK_MASK                   (0x1U)
#define VBAT_WAKLCKB_LOCK_SHIFT                  (0U)
/*! LOCK - Lock
 *  0b0..Lock is enabled
 *  0b1..Lock is disabled
 */
#define VBAT_WAKLCKB_LOCK(x)                     (((uint32_t)(((uint32_t)(x)) << VBAT_WAKLCKB_LOCK_SHIFT)) & VBAT_WAKLCKB_LOCK_MASK)
/*! @} */


/*!
 * @}
 */ /* end of group VBAT_Register_Masks */


/*!
 * @}
 */ /* end of group VBAT_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_VBAT_H_ */

